import styles from "./agreement.module.scss";

export function Agreement() {
  return (
    <>
      <h2 className={styles.agreement__title}>
        Згода на обробку персональних даних Користувача
      </h2>
      <p className={styles.paragraph}>
        1. Користувач веб-сайту https://www.kage-store.com.ua/ (далі – Cайт) діє
        особисто, від свого імені, добровільно і самостійно. Користувач Сайту
        бере на себе всі ризики відповідальності і наслідків, пов’язані з
        можливою участю в пропозиціях, розміщених на Сайті.
      </p>
      <p className={styles.paragraph}>
        2. Користувач Сайту дає згоду на обробку своїх персональних даних
        відповідно до Закону України «Про захист персональних даних» від
        01.06.2010 р № 2297-VI, та на умовах, зазначених нижче.
      </p>
      <p className={styles.paragraph}>
        3.Приймаючи пропозиції, розміщені на Сайті, і заповнюючи реєстраційні
        форми на Сайті, кожен Користувач Сайту свідчить і підтверджує, що
        ознайомлений і повністю згоден з правилами, викладеними в цій Угоді, що
        зобов’язується їх дотримувати, що він ознайомлений з правами, що
        стосуються його персональних даних, а також з тим, що добровільне
        надання його персональних даних є згодою на їх обробку Адміністрацією
        Сайту на свій розсуд будь-якими способами з маркетинговою та / або
        будь-якою іншою метою, що не суперечить законодавству України
        (проведення маркетингового дослідження, для підготовки статистичної
        інформації тощо).
      </p>
      <p className={styles.paragraph}>
        4. Беручи участь в пропозиціях, розміщених на Сайті, і заповнюючи
        реєстраційні форми на Сайті, кожен Користувач Сайту підтверджує, що він
        ознайомлений з правами, що стосуються його персональних даних, і цим
        підтверджує, що Адміністрація Сайту та інші треті особи звільнені від
        зобов’язання направляти Користувачеві Сайту письмове повідомлення про
        права, мета збору даних і осіб, яким передаються персональні дані
        Користувача Сайту.
      </p>
      <p className={styles.paragraph}>
        5. Погоджуючись з цією Угодою, Користувач Сайту дає свою згоду
        отримувати інформацію, пов’язану з поточними пропозиціями на Сайті.
        Адміністрація Сайту залишає за собою право направляти Користувачеві
        Сайту будь-яку інформацію по електронній пошті на електронну адресу,
        вказану Користувачем Сайту в реєстраційній формі, без попередньої
        домовленості з Користувачем Сайту.
      </p>
      <p className={styles.paragraph}>
        6. Користувач Сайту, як суб’єкт персональних даних, має право:– на
        отримання відомостей про місцезнаходження Адміністрації Сайту як
        власника / розпорядника його персональних даних;– вимагати від
        Адміністрації Сайту як власника / розпорядника його персональних даних
        уточнення своїх персональних даних;
      </p>
    </>
  );
}
