import styles from "./returning.module.scss";

export function Returning() {
  return (
    <div className={styles.returning}>
      <h2 className={styles.returning__title}>ОБМІН ТА ПОВЕРНЕННЯ</h2>
      <h3 className={styles.returning__subtitle}>Брак</h3>
      <p>
        Ми дуже уважно ставимося до якості нашої продукції і тому дуже ретельно
        вивчаємо будь-яку скаргу чи зауваження. Якщо Ви незадоволені якістю
        Вашого замовлення, надішліть, будь ласка, Ваші зауваження та детальні
        фотографії, що саме не так із Вашим замовленням на електронну пошту –
        admin@kage-store.com.ua.
      </p>
      <p>
        Ми замінимо Вам товар, якщо виявлено явний брак на текстилі або принті.
      </p>
      <p>
        <span className={styles["returning__item"]}>
          До браку не належать товари, які не підійшли:
        </span>
        <br />
        1. За кольором виробу або за кольором друку <br /> 2. Якщо вибрано не
        той метод друку, крім випадків, коли з менеджером обговорювався
        конкретний метод друку
        <br /> 3. Не підходить розмір виробу, крім випадків коли замовлено на
        сайті один розмір, а отримали інший і він не відповідає вказаній на
        сайті розмірної сітки.
      </p>
      <p>
        <span className={styles["returning__item"]}>
          До браку належать товари, які
        </span>
        <br />
        1. Розмір виробу не відповідає розмірній сітці.
        <br />
        2. На виробі є брак (наприклад дірка у тканині)
        <br />
        3. Відсутня частина замовленого принта
        <br />
        Після отримання листа від Вас про брак ми гарантуємо в найкоротші
        терміни замінити Вам виріб або повернути гроші. Заміна бракованого
        товару проводиться <strong>нашим коштом</strong>.
      </p>
      <p className={styles.returning__technologies}>
        Хочемо звернути Вашу увагу, що при технології прямого цифрового друку на
        кольорових тканинах, перед нанесенням виріб обробляється спеціальною
        рідиною (праймером) для того, щоб зображення могло надрукуватися на
        виробі. І після термічного закріплення зображення може залишатися слід
        від праймера, він зникає після першого ж прання. Якщо слід від праймера
        не зникне після прання, ми замінимо Вам товар.
      </p>
      <h3 className={styles.returning__subtitle}>
        Якщо вам не підійшов розмір:
      </h3>
      <p>
        При оформленні замовлення обов'язково ознайомтесь з нашою розмірною
        сіткою, вона відрізняється, як на різні види продукції, так і у кожного
        виробника в цілому. Якщо Ви постійно купляєте одяг в одного виробника
        розміру М, то це не значить, що Вам також підійде такий розмір наших
        виробів.
      </p>
      <p>
        Якщо розмір виробу з друком Вам не підійшов, то він не підлягає обміну
        або поверненню. Ми друкуємо всі вироби індивідуально на Ваше замовлення,
        у нас немає готових виробів з принтами, відповідно ми не можемо обміняти
        або прийняти Ваше замовлення, якщо воно належної якості. Вся продукція,
        яку ми виготовляємо підпадає під статтю №13, частина 5, пункт 3 в законі
        “Про захист прав споживачів”. Ці товари виготовляються індивідуально для
        Вас в єдиному екземплярі і не можуть бути продані іншим особам,
        <strong>отже такі товари не підлягають обміну або поверненню!</strong>
      </p>
      <p>
        Якщо Ви помилилися з розміром, ми можемо Вам запропонувати переробити
        Ваше замовлення зі знижкою. Про розмір знижки Вас проконсультують наші
        менеджери.
      </p>
      <h3 className={styles.returning__subtitle}>
        Якщо вам не підійшов коліп друку:
      </h3>
      <p>
        Друк на тканині відрізняється від друку на папері або фото друку - тому,
        враховуючи складність поверхні для друку, кольори можуть відрізнятися
        від тих, що Ви бачите на екрані монітора, або бачили, коли друкували цей
        принт на папері. Якихось певних кольорів можливо досягти тільки зробивши
        пробу друку і скоректувати результат виходячи з методу друку та тканини.
        Якщо Вам потрібно досягти якихось певних результатів попередьте про це
        менеджера на момент узгодження замовлення. У будь-яких інших ситуаціях
        всі макети приймаються для друку як є і спрогнозувати результат друку
        можливо лише після друку.
      </p>
    </div>
  );
}
