import styles from "./contract.module.scss";

export function Contract() {
  return (
    <div className={styles.contract__content}>
      <p>
        <strong>Загальні положення</strong>
      </p>
      <p>
        1.1. Справжня оферта, є офіційною пропозицією ФОП XXX, далі за текстом -
        «Продавець», укласти Договір купівлі-продажу товарів дистанційним
        способом, тобто через Інтернет-магазин, далі по тексту - «Договір», і
        розміщує Публічну оферту (пропозицію) на офіційному інтернет-сайті
        Продавця «https://kage-store.com.ua (далі -« Інтернет-сайт »).
      </p>
      <p>
        1.2. Моментом повного і безумовного прийняття Покупцем пропозиції
        Продавця (акцептом) укласти електронний договір купівлі-продажу товарів,
        вважається факт оплати Покупцем замовлення на умовах цього Договору, у
        строки та за цінами, вказаними на Інтернет-сайті Продавця.
      </p>
      <h3>Поняття і визначення</h3>
      <p>
        2.1. У цій оферті, якщо контекст не вимагає іншого, наведені нижче
        терміни мають таке значення:
      </p>
      <p>
        * «Товар» - моделі, аксесуари, комплектуючі та супровідні предмети без
        нанесенного зображення;
      </p>
      <p>
        * «Товар з послугою друка» - вибранний товар покупцем з замовленням
        друку на цьому товарі;
      </p>
      <p>
        * «Інтернет-магазин» - відповідно до Закону України «про електронну
        комерцію», засіб для подання або реалізації товару, роботи або послуги
        шляхом здійснення електронної угоди.
      </p>
      <p>
        * «Продавець» - компанія, яка реалізує товари, представлені на
        Інтернет-сайті.
      </p>
      <p>
        * «Покупець» - фізична особа, що уклала з Продавцем Договір на умовах,
        викладених нижче.
      </p>
      <p>
        * «Замовлення» - вибір окремих позицій з переліку товарів та послуг,
        зазначених Покупцем при розміщенні замовлення і проведенні оплати.
      </p>
      <h3>Предмет договору</h3>
      <p>
        3.1. Продавець зобов'язується передати у власність Покупця Товар, а
        Покупець зобов'язується оплатити і прийняти Товар на умовах даного
        Договору.
      </p>
      <p>
        Цей Договір регулює купівлю-продаж товарів в Інтернет-магазині або
        послуги, в тому числі:
      </p>
      <p>- добровільний вибір Покупцем товарів/послуг в Інтернет-магазині;</p>
      <p>- самостійне оформлення Покупцем замовлення в Інтернет-магазині;</p>
      <p>- оплата Покупцем замовлення, оформленого в Інтернет-магазині;</p>
      <p>
        - обробка і доставка замовлення Покупцеві у власність на умовах цього
        Договору.
      </p>
      <h3>Порядок оформлення замовлення</h3>
      <p>
        4.1. Покупець має право оформити замовлення на будь-який товар/послугу,
        представлений на Сайті Інтернет-магазину і наявний.
      </p>
      <p>
        4.2. Кожна позиція може бути представлена в замовленні в будь-якій
        кількості.
      </p>
      <p>
        4.3. При відсутності товару на складі, Менеджер компанії зобов'язаний
        поставити Покупця до відома (по телефону або через електронну пошту).
      </p>
      <p>
        4.4. При відсутності товару Покупець має право замінити його товаром
        аналогічної моделі, відмовитися від даного товару, анулювати замовлення.
      </p>
      <h3>Послуги</h3>
      <p>
        5.1. Сайт kage-store.com.ua зобов'язується з моменту отримання
        замовлення та узгодження з Покупцем надати Покупцеві послуги з обробки
        та виконання його замовлення, а саме:
      </p>
      <p className={styles.contract__strong}>
        - виробництва Продукції шляхом нанесення Образів наданих особою на
        Товари безпосередньо чи їх упаковки, етикетки, нашивки, бірки, а також
        на будь-які інші предмети, в яких можуть міститися такі Товари та/або
        предмети, які прикріплені до Товарів, та/або включення Образів в Товари
        іншим способом;
      </p>

      <p>
        5.2. При взаємовідносинах сайту kage-store.com.ua і Покупця вони
        підтверджують, що не несуть відповідальність один за одного і не
        відповідають за зобов'язаннями один одного.
      </p>
      <p>
        5.3. Всі товари з послугою друку з сайту kage-store.com.ua
        виготовляються за індивідуальним замовленням Клієнта. Обмін і повернення
        товарів p послугою друку, виготовлених на замовлення, описаний в статті
        №13, частина 5, пункт 3 в законі "Про захист прав споживачів". А саме
        "3) договір стосується виготовлення або переробки товару на замовлення
        споживача, тобто якщо товар не може бути переданий іншим особам або може
        бути проданий лише з істотними фінансовими втратами для продавця;".
      </p>
      <h3>Умови доставки замовлення</h3>
      <p>
        6.1. Доставка товарів та/або товарів з послугою, придбаних в
        Інтернет-магазині, здійснюється до складів транспортних компаній, де і
        здійснюється видача замовлень.
      </p>
      <p>
        6.2. Разом із замовленням Покупцеві надаються документи згідно
        законодавства України.
      </p>
      <h3>Права та обов'язки сторін:</h3>
      <p>7.1. Продавець має право:</p>
      <p>
        - в односторонньому порядку припинити надання послуг за цим договором у
        разі порушення Покупцем умов цього договору.
      </p>
      <p>7.2. Покупець зобов'язаний:</p>
      <p>
        - своєчасно оплатити та отримати замовлення на умовах цього договору.
      </p>
      <p>7.3. Покупець має право:</p>
      <p>- оформити замовлення в Інтернет-магазині;</p>
      <p>- оформити електронний договір;</p>
      <p>- вимагати від Продавця виконання умов цього Договору.</p>
      <h3>Відповідальність сторін</h3>
      <p>
        8.1. Сторони несуть відповідальність за невиконання або неналежне
        виконання умов цього договору в порядку, передбаченому цим договором та
        чинним законодавством України.
      </p>
      <p>8.2. Продавець не несе відповідальності за:</p>
      <p>- змінений виробником зовнішній вигляд Товару;</p>
      <p>
        - за невідповідність колірної гами товару, що може відрізнятися від
        оригіналу товару виключно через різний колір передачі моніторів
        персональних комп'ютерів окремих моделей;
      </p>
      <p>
        - за зміст і правдивість інформації, наданої Покупцем при оформленні
        замовлення;
      </p>
      <p>
        - за затримку і перебої в наданні Послуг (обробки замовлення та доставки
        товару), які відбуваються з причин, що знаходяться поза сферою його
        контролю;
      </p>
      <p>
        - за протиправні незаконні дії, здійснені Покупцем за допомогою даного
        доступу до мережі Інтернет;
      </p>
      <p>
        - за передачу Покупцем своїх мережевих ідентифікаторів - IP, MAC-адреси,
        логіна і пароля третім особам;
      </p>
      <p>
        8.3. Покупець, використовуючи наданий йому доступ до мережі Інтернет,
        самостійно несе відповідальність за шкоду, заподіяну його діями
        (особисто, навіть якщо під його логіном знаходилося іншу особу) особам
        або їх майну, юридичним особам, державі чи моральним принципам
        моральності.
      </p>
      <p>
        8.4. У разі настання обставин непереборної сили, сторони звільняються
        від виконання умов цього договору. Під обставинами непереборної сили для
        цілей цього договору розуміються події, що мають надзвичайний,
        непередбачений характер, які виключають або об'єктивно заважають
        виконанню цього договору, настання яких Сторони не могли передбачити і
        запобігти розумними засобами.
      </p>
      <p>
        8.5. Сторони прикладають максимум зусиль для вирішення будь-яких
        розбіжностей виключно шляхом переговорів.
      </p>
      <h3>Інші умови</h3>
      <p>
        9.1. Інтернет-магазин залишає за собою право в односторонньому порядку
        вносити зміни до цього договору за умови попередньої публікації його на
        сайті https://kage-store.com.ua
      </p>
      <p>
        9.2. Інтернет-магазин створений для організації дистанційного способу
        продажу товарів через Інтернет.
      </p>
      <p>
        9.3. Покупець несе відповідальність за достовірність інформації,
        зазначеної при оформленні замовлення інформації. При цьому, при
        здійсненні акцепту (оформленні замовлення і подальшої оплати товару)
        Покупець надає Продавцю свою беззастережну згоду на збір, обробку,
        зберігання, використання своїх персональних даних, в розумінні ЗУ «Про
        захист персональних даних».
      </p>
      <p>
        9.4. Оплата Покупцем оформленого в Інтернет-магазині замовлення означає
        повну згоду Покупця з умовами договору купівлі-продажу (публічної
        оферти)
      </p>
      <p>
        9.5. Фактичною датою електронного угоди між сторонами є дата прийняття
        умов, відповідно до ст. 11 Закону України «Про електронну комерцію»
      </p>
      <p>
        9.6. Використання ресурсу Інтернет-магазину для попереднього перегляду
        товару, а також для оформлення замовлення для Покупця є безкоштовним.
      </p>
      <p>
        9.7. Інформація, яку надає Покупцем є конфіденційною. Інтернет-магазин
        використовує інформацію про Покупця виключно в цілях обробки замовлення,
        відправлення повідомлень Покупцеві, доставки товару, здійснення
        взаєморозрахунків тощо.
      </p>
      <h3>Порядок повернення товару</h3>
      <p>
        10.1. Повернення товару в Інтернет-магазин проводиться згідно чинного
        законодавства України.
      </p>
      <p>
        10.2. Повернення товару в Інтернет-магазин проводиться за рахунок
        Покупця.
      </p>
      <p>
        10.3. При поверненні Покупцем товару належної якості, Інтернет-магазин
        повертає йому сплачену за товар грошову суму за фактом повернення товару
        за вирахуванням компенсації витрат Інтернет-магазину пов'язаних з
        доставкою товару Покупцеві.
      </p>
      <p>
        10.4. Обмін товару або повернення коштів за нього Замовникові можливий
        тільки в разі браку товару.
      </p>
      <h3>Термін дії договору</h3>
      <p>
        11.1.Електронний договір вважається укладеним з моменту одержання особою
        яка направила пропозицію укласти такий договір, відповіді про прийняття
        цієї пропозиції в порядку, визначеному частиною шостою статті 11 Закону
        України "Про електронну комерцію".
      </p>
      <p>
        11.2. До закінчення терміну дії цей Договір може бути розірваний за
        взаємною згодою сторін до моменту фактичної доставки товару, шляхом
        повернення грошових коштів
      </p>
      <p>
        11.3. Сторони мають право розірвати цей договір в односторонньому
        порядку, в разі невиконання однією із сторін умов цього Договору та у
        випадках передбачених чинним законодавством України.
      </p>
      <p>
        Звертаємо вашу увагу, що інтернет-магазин «kage-store.com.ua» на
        офіційному інтернет-сайті https://kage-store.com.ua, має право,
        відповідно до законодавства України, надавати право користування
        інтернет платформою ФОП і юридичним особам для реалізації товару.
      </p>
    </div>
  );
}
