"use client";

import styles from "./delivery.module.scss";
import { useState } from "react";
import { DeliveryType } from "./deliveryType/deliveryType";
export function Delivery() {
  const [newPost, setNewPost] = useState(true);
  const [newPostDelivery, setNewPostDelivery] = useState(false);
  const [ukrPost, setukrPost] = useState(false);

  return (
    <div className={styles.delivery}>
      <h2 className={styles[`delivery-payment__title`]}>ДОСТАВКА ТА ОПЛАТА</h2>
      <h3>ДОСТАВКА</h3>
      <ul className={styles.delivery__types}>
        <li
          onClick={() => {
            setNewPost(true);
            setNewPostDelivery(false);
            setukrPost(false);
          }}
          className={`${styles["delivery__type"]} ${
            newPost && styles["delivery__type--active"]
          }`}
        >
          Нова Пошта
        </li>
        <li
          onClick={() => {
            setNewPost(false);
            setNewPostDelivery(true);
            setukrPost(false);
          }}
          className={`${styles["delivery__type"]} ${
            newPostDelivery && styles["delivery__type--active"]
          }`}
        >
          Адресна доставка Новою поштою
        </li>
        <li
          onClick={() => {
            setNewPost(false);
            setNewPostDelivery(false);
            setukrPost(true);
          }}
          className={`${styles["delivery__type"]} ${
            ukrPost && styles["delivery__type--active"]
          }`}
        >
          Укрпошта
        </li>
      </ul>
      <ul>
        <li
          className={`${styles["delivery__type-content"]} ${
            newPost && styles["delivery__type-content--active"]
          }`}
        >
          <DeliveryType
            term={"1-2 доби"}
            sending={"кожен день після 16:00 окрім суботи та неділі"}
            payment={
              "передоплата банківською картою онлайн або оплата при отриманні замовлення"
            }
            cost={
              "безкоштовно - сума замовлення від 1000 грн. і при умові 100% передоплати; приблизно 70 грн.* - передоплата; приблизно 110 грн. + 2%* - оплата при отриманні замовлення."
            }
            type={"Доставка на відділення нової пошти"}
            typeHow={
              "Нова пошта – оператор №1 на ринку експрес-доставки, який надає послуги швидкої, зручної та надійної доставки посилок в будь-яку точку України. Має безліч відділень по всій країні. Доставляє посилки між обласними центрами за 24 години. Актуальні терміни доставки до Вашого міста Ви можете узнати на сайті Нової Пошти."
            }
            receiving={"Як отримати посилку на Новій Пошті?"}
            receivingHow1={
              "Для того, щоб отримати посилку на Новій пошті Вам знадобиться паспорт або додаток на мобільному телефоні від компанії Нова пошта."
            }
            receivingHow2={
              "При отриманні відправлення, оператору відділення, потрібно назвати номер транспортної накладної або Ваш номер телефона, або Прізвище, або відсканувати додаток."
            }
            receivingHow3={
              "Оператор видасть Вам посилку, відкрийте її й уважно огляньте."
            }
            receivingHow4={
              "Якщо Вас все влаштовує, то просто заберіть посилку, якщо вона вже оплачена  або, якщо у Вас відправка з післяплатою, то попередньо сплатіть її."
            }
            receivingHow5={
              "Якщо Ви бачите якийсь брак, або щось сталось з відправленням під час транспортування, то зафіксуйте цей факт зі співробітником Нової Пошти та далі дійте за його підказками. Хочемо Вас запевнити, що ми ніколи не відправляємо чашки з відбитими ручками або одяг з дірками від ножиць, тому якщо Ви стали свідком такого, то це результат недбалого транспортування або слідство необережного відкриття посилки. Тому дуже просимо звертати увагу на те, що Вам показує співробітник Нової пошти та своєчасно фіксувати цей факт в його присутності та писати скаргу."
            }
            receivingHow6={
              "Також звертаємо Вашу увагу на те, що відправлення зберігається на відділенні Нової пошти протягом 5 днів, а потім повертається нам, це умови зберігання, які пропонує компанія Нова Пошта для інтернет-магазинів, ми не можемо якось вплинути на них. Якщо у Вас не виходить забрати замовлення в цей термін, повідомте, будь ласка, наших менеджерів про це і вони спробують збільшити кількість днів зберігання, якщо це можливо."
            }
          />
        </li>
        <li
          className={`${styles["delivery__type-content"]} ${
            newPostDelivery && styles["delivery__type-content--active"]
          }`}
        >
          <DeliveryType
            term={"1-2 доби"}
            sending={"кожен день після 16:00 окрім суботи та неділі"}
            payment={"передоплата"}
            cost={"приблизно 120 грн.* - передоплата;"}
            type={"Адресна доставка курʼєром"}
            typeHow={
              "Якщо Ви хочете, щоб замовлення Вам було доставлено до дому або в офіс, то Ви можете скористатись цим видом доставки."
            }
            receiving={"Як отримати відправлення?"}
            receivingHow1={
              "Для того, щоб отримати відправлення, Вам знадобиться паспорт або мобільний додаток від копніі Нова пошта."
            }
            receivingHow2={
              "В день доставки Вам заздалегідь зателефонує кур'єр і узгодить час, у котрий Вам буде зручно отримати відправлення. Якщо Вас не буде на місці, або у Вас змінились плани, будь ласка, попередьте про це кур'єра."
            }
            receivingHow3={
              "Після того, як кур'єр привезе замовлення, будь ласка, уважно огляньте посилку."
            }
            receivingHow4={
              "Якщо Вас все влаштовує, то просто заберіть посилку, якщо вона вже оплачена  або, якщо у Вас відправка з післяплатою, то попередньо сплатіть її."
            }
            receivingHow5={
              "Якщо Ви бачите якийсь брак, або щось сталось з відправленням під час транспортування, то зафіксуйте цей факт зі співробітником Нової Пошти та далі дійте за його підказками. Хочемо Вас запевнити, що ми ніколи не відправляємо чашки з відбитими ручками або одяг з дірками від ножиць, тому якщо Ви стали свідком такого, то це результат недбалого транспортування або слідство необережного відкриття посилки. Тому дуже просимо звертати увагу на те, що Вам показує співробітник Нової пошти та своєчасно фіксувати цей факт в його присутності та писати скаргу."
            }
          />
        </li>
        <li
          className={`${styles["delivery__type-content"]} ${
            ukrPost && styles["delivery__type-content--active"]
          }`}
        >
          <DeliveryType
            term={"3-4 доби"}
            sending={"кожен день після 16:00 окрім суботи та неділі"}
            payment={"передоплата"}
            cost={
              "безкоштовно - сума замовлення від 1000 грн. і при умові 100% передоплати; приблизно 50 грн.* - передоплата;"
            }
            type={"Доставка на відділення «Укрпошта»"}
            typeHow={
              "Якщо термін доставки не має для великого значення або Ви живете там де є тільки відділення Укрпошти, або Ви просто вирішили трошки зберегти кошти на доставці - то Ви можете обрати доставку Укрпоштою. Для того, щоб  оформити замовлення Укрпоштою, Ви повинні знати номер Вашого відділення Укрпошти."
            }
            receiving={"Як отримати посилку на Укрпошті?"}
            receivingHow1={
              "Зазвичай доведеться постояти в черзі. Після цього назвати оператору номер транспортної накладної, яка Вам прийде в смс на мобільний телефон. Також Вам знадобиться паспорт, щоб підтвердити свою особистість."
            }
            receivingHow2={
              "Уважно огляньте посилку.  Якщо Вас все влаштовує, то просто заберіть посилку."
            }
            receivingHow3={
              "Якщо Ви бачите якийсь брак, або щось сталось з відправленням під час транспортування, то зафіксуйте цей факт зі співробітником Укрпошти та далі дійте за його підказками."
            }
          />
        </li>
      </ul>
    </div>
  );
}
